<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"9814c4478015f4b494bbfd47dcfdecf38e2e9eb0c9ed9cd38ebcb60a11f5b91c","plan_job_ref":"Job Write Terraform Plan to Pull Request #53 at https://github.com/hackforla/devops-security/actions/runs/10036326406","plan_out_hash":"6970f40cc9cdbeda8cce57dec0b3c07cf35c2eec4ff1fa4a403f4bf16086ee02","plan_hash":"be9c9ab3b80b8fe8d60f826def469559762058a9a913f59dd87f2245eb88eea0","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.iam_user_rsakuma.aws_iam_user.user will be created
+   resource "aws_iam_user" "user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "rsakuma"
+       path          = "/"
+       tags          = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       tags_all      = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       unique_id     = (known after apply)
    }

  # module.iam_user_rsakuma.aws_iam_user_group_membership.user_group_membership will be created
+   resource "aws_iam_user_group_membership" "user_group_membership" {
+       groups = [
+           "read-only-group",
        ]
+       id     = (known after apply)
+       user   = "rsakuma"
    }

  # module.iam_user_rsakuma.aws_iam_user_login_profile.user_login will be created
+   resource "aws_iam_user_login_profile" "user_login" {
+       encrypted_password      = (known after apply)
+       id                      = (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_length         = 20
+       password_reset_required = true
+       user                    = "rsakuma"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #53](https://github.com/hackforla/devops-security/actions/runs/10036326406)